/** 天干五行 */
export const GanElement = {
  甲: "木",
  乙: "木",
  丙: "火",
  丁: "火",
  戊: "土",
  己: "土",
  庚: "金",
  辛: "金",
  壬: "水",
  癸: "水"
};

/** 八門五行 */
export const DoorElement = {
  開門: "金",
  休門: "水",
  生門: "土",
  傷門: "木",
  杜門: "木",
  景門: "火",
  死門: "土",
  驚門: "金"
};

/** 九星五行 */
export const StarElement = {
  天蓬: "水",
  天任: "土",
  天沖: "木",
  天輔: "木",
  天英: "火",
  天芮: "土",
  天柱: "金",
  天心: "金",
  天禽: "土"
};

/** 五行生剋關係 */
export const ElementRelation = {
  generates: {
    木: "火",
    火: "土",
    土: "金",
    金: "水",
    水: "木"
  },
  controls: {
    木: "土",
    土: "水",
    水: "火",
    火: "金",
    金: "木"
  }
};
